In [1]:
import pandas as pd
import numpy as np

In [16]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

people_2 = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing'],
    'data' : [np.nan, np.nan , np.nan ,np.nan ,np.nan ,np.nan ,np.nan]
}


df = pd.DataFrame(people)
df_2 = pd.DataFrame(people_2)

In [17]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [18]:
# removing all data with NaN
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [19]:
# what the default actually look like
df.dropna(axis = 'index' , how = 'any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [20]:
# only drops rows when all of the cells have missing values
df.dropna(axis = 'index', how = 'all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [15]:
# drops columns if all of the cells have missing values
df.dropna(axis = 'columns' , how = 'all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [23]:
# drops the entire data column for df_2 because all of it has missing values
df_2.dropna(axis = 'columns', how = 'all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [25]:
# drops column if any of the cell has misisng values
df.dropna(axis = 'columns' , how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [28]:
# only drops rows if they have missing email
df.dropna(axis = 'index', how = 'any', subset = ['email'])
# any or all provides the same result in this case

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [30]:
# only drops column if last name or email is misisng
df.dropna(axis = 'index', how = 'all', subset = ['last', 'email'])
# any drops the row if either last or email is msissing. all drops the row if both of them are missing

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [34]:
# NA, Missing are customised null values. they can be replaced by NaN
df.replace('NA', np.nan, inplace = True)
df.replace('Missing', np.nan, inplace = True)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [35]:
# checking which values are na in a dataframe
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [36]:
# filling mssing/na values. Could be useful for numerical data?
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [37]:
# object means its a string or a mix of different stuff
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [38]:
# finding mean for age directly does not work because age is in string as opposed to integer. 
# We need to convert it to number first
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [39]:
# what type is np.nan?
type(np.nan)

float

In [41]:
df['age'] = df['age'].astype(float)

In [44]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [45]:
df['age'].mean()

46.75

In [46]:
# We can also replace the na./missing values while loading in the csv file
# na_vals = ['NA', 'Missing']
# df = pd.read_csv("somefile.csv", na_values = na_vals)

In [49]:
# finding the average number of years responders have been coding for
df_survey = pd.read_csv('C:\\Users\\Noel\\Downloads\\unzipped_data\\survey_results_public.csv')
df_survey['YearsCode'] = df_survey['YearsCode'].astype(float)

ValueError: could not convert string to float: 'Less than 1 year'

In [50]:
df_survey['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [53]:
df_survey['YearsCode'].replace('Less than 1 year', 0 ,inplace = True)

In [56]:
df_survey['YearsCode'].replace('More than 50 years' , 51, inplace = True)

In [59]:
df_survey['YearsCode'] = df_survey['YearsCode'].astype(float)

In [60]:
df_survey['YearsCode'].mean()

11.662114216834588

In [61]:
df_survey['YearsCode'].median()

9.0